web/tutorials/precice/twophase_left/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          16;
        startFace       17708;
    }
    outlet
    {
        type            patch;
        nFaces          120;
        startFace       17724;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          216;
        startFace       17844;
    }
    atmosphere
    {
        type            patch;
        nFaces          72;
        startFace       18060;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          17920;
        startFace       18132;
    }
)

// ************************************************************************* //
