web/tutorials/precice/twophase_left/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "../../../../library/precice_configs/tc_partitioned_twophase.xml";

participant Fluid1;

modules (FF);

interfaces
{
  Interface1
  {
    mesh              Fluid1-Mesh;
    patches           (outlet);
    
    readData
    (
      AlphaGradient
      VelocityGradient
      Pressure
    );
    
    writeData
    (
      Alpha
      Velocity
    );
  };
};

FF
{
  nameP   p_rgh;
  nameAlpha alpha.water;
  nameU U;
}
